<?php

return [
    /*-- FOR TEXT --*/
    "min" => "Мінімально допустима кількість символів для поля :name - :val",
    "max" => "Максимально допустима кількість символів для поля :name - :val",
    "required" => "Поле :name є обов'язковим до заповнення",

    /*-- FOR FILES --*/
    "maxsize" => "Максимально допустимий розмір файлу для поля :name - :val кілобайт",

    /*-- FOR IMAGES --*/
    "image" => "Поле :name приймає лише зображення. Допустимі розширення: 'png', 'jpeg', 'jpg'",
    "proportions" => "Зображення для поля :name повинне чітко відповідати розмірам :width (ширина) на :height (висота) пікселів",
    "maxheight" => "Максимально допустима висота зображення для поля :name становить :val пікселів",
    "maxwidth" => "Максимально допустима ширина зображення для поля :name пстановить :val пікселів",
    "minheight" => "Мінімально допустима висота зображення для поля :name становить :val пікселів",
    "minwidth" => "Мінімально допустима ширина зображення для поля :name становить :val пікселів",

    /*-- FOR NUMBERS --*/
    "int" => "Поле :name риймає лише цілі числа",
];